require("../../../@babel/runtime/helpers/Arrayincludes"),
  require("../../../app.js");
exports.riskTest = {
  version: "1",
  statements: [
    "本问卷旨在了解您可承受的风险程度等情况，借此协助您选择合适的产品或服务类别，以符合您的风险承受能力。",
    "风险承受能力评估是华林证券向投资者履行适当性职责的一个环节，其目的是使华林证券所提供的产品或服务与您的风险承受能力等级相匹配。",
    "华林证券特别提醒您：华林证券向投资者履行风险承受能力评估等适当性职责，并不能取代您自己的投资判断，也不会降低产品或服务的固有风险。同时，与产品或服务相关的投资风险、履约责任以及费用等将由您自行承担。",
    "华林证券提示您：华林证券根据您提供的信息对您进行风险承受能力评估，开展适当性工作。您应当如实提供相关信息及证明材料，并对所提供的信息和证明材料的真实性、准确性、完整性负责。",
    "华林证券建议：当您的各项状况发生重大变化时，需对您所投资的产品及时进行重新审视，以确保您的投资决定与您可承受的投资风险程度等实际情况一致。",
    "华林证券在此承诺，对于您在本问卷中所提供的一切信息，华林证券将严格按照法律法规要求承担保密义务。除法律法规规定的有权机关依法定程序进行查询以外，华林证券保证不会将涉及您的任何信息提供、泄露给任何第三方，或者将相关信息用于违法、不当用途。",
  ],
  prompts: [
    {
      group: "财务状况",
      questions: [
        {
          ask: "您的主要收入来源是",
          answers: [
            "工资、劳务报酬",
            "生产经营所得",
            "利息、股息、转让证券等金融性资产收入",
            "出租、出售房地产等非金融性资产收入",
            "无固定收入，或者个人或家庭人均收入低于当地城乡居民最低生活保障标准",
            "退休金、养老金收入",
          ],
        },
        {
          ask: "最近您家庭预计进行证券投资的资金占家庭现有总资产(不含自住、自用房产及汽车等固定资产)的比例是",
          answers: ["70%以上", "50%-70%", "30%－50%", "10%－30%", "10%以下"],
        },
        {
          ask: "您是否有尚未清偿的数额较大的债务，如有，其性质是",
          answers: [
            "没有",
            "有，住房抵押贷款等长期定额债务",
            "有，信用卡欠款、消费信贷等短期信用债务",
            "有，亲朋之间借款",
          ],
        },
        {
          ask: "您可用于投资的资产数额（包括金融资产和不动产）为",
          answers: [
            "不超过50万元人民币",
            "50万-300万元（不含）人民币",
            "300万-1000万元（不含）人民币",
            "1000万元人民币以上",
          ],
        },
      ],
    },
    {
      group: "投资知识",
      questions: [
        {
          ask: "以下描述中何种符合您的实际情况",
          answers: [
            "现在或此前曾从事金融、经济或财会等与金融产品投资相关的工作超过两年",
            "已取得金融、经济或财会等与金融产品投资相关专业学士以上学位",
            "取得证券从业资格、期货从业资格、注册会计师证书（CPA）或注册金融分析师证书（CFA）中的一项及以上",
            "我不符合以上任何一项描述",
          ],
          conflicts: {
            B: [
              {
                key: "customFn",
                customFn: function (s) {
                  return ["3", "4", "5", "6"].includes(s.edu || "");
                },
              },
            ],
          },
        },
      ],
    },
    {
      group: "投资经验",
      questions: [
        {
          ask: "您的投资经验可以被概括为",
          answers: [
            "有限：除银行活期账户和定期存款外，我基本没有其他投资经验",
            "一般：除银行活期账户和定期存款外，我购买过基金、保险等理财产品，但还需要进一步的指导",
            "丰富：我是一位有经验的投资者，参与过股票、基金等产品的交易，并倾向于自己做出投资决策",
            "非常丰富：我是一位非常有经验的投资者，参与过权证、期货或创业板等高风险产品的交易",
          ],
        },
        {
          ask: "有一位投资者一个月内做了15笔交易（同一品种买卖各一次算一笔），您认为这样的交易频率",
          answers: ["太高了", "偏高", "正常", "偏低"],
        },
        {
          ask: "过去一年时间内，您购买的不同产品或接受的不同服务（含同一类型的不同产品或服务）的数量是",
          answers: ["5个以下", "6至10个", "11至15个", "16个以上"],
        },
        {
          ask: "以下金融产品或服务，您投资经验在两年以上的有",
          answers: [
            "银行存款等",
            "债券、货币市场基金、债券型基金或其它固定收益类产品等",
            "股票、混合型基金、偏股型基金、股票型基金等权益类投资品种等",
            "期货、融资融券",
            "复杂金融产品、其他产品或服务",
          ],
          conflicts: {
            C: [{ key: "riskOption", disabled: ["6:A"] }],
            D: [{ key: "riskOption", disabled: ["6:A"] }],
            E: [{ key: "riskOption", disabled: ["6:A"] }],
          },
        },
        {
          ask: "如果您曾经从事过金融市场投资，在交易较为活跃的月份，平均月交易额大概是多少",
          answers: [
            "10万元以内",
            "10万元-30万元",
            "30万元-100万元",
            "100万元以上",
            "从未从事过金融市场投资",
          ],
          conflicts: {
            E: [
              {
                key: "riskOption",
                disabled: ["6:B", "6:C", "6:D", "9:B", "9:C", "9:D", "9:E"],
              },
            ],
          },
        },
      ],
    },
    {
      group: "投资目标",
      questions: [
        {
          ask: "您用于证券投资的大部分资金不会用作其它用途的时间段为",
          answers: ["0到1年（短期）", "1到5年（中期）", "5年以上（长期）"],
        },
        {
          ask: "您打算重点投资于哪些种类的投资品种",
          answers: [
            "债券、货币市场基金、债券基金等固定收益类投资品种",
            "股票、混合型基金、偏股型基金、股票型基金等权益类投资品种",
            "期货、融资融券等",
            "复杂或高风险金融产品或服务",
            "其他产品或服务",
          ],
        },
        {
          ask: "您的预期收益",
          answers: ["10%以内", "10%-30%", "30%-50%", "50%以上"],
        },
      ],
    },
    {
      group: "风险偏好",
      questions: [
        {
          ask: "当您进行投资时，您的首要目标是",
          answers: [
            "尽可能保证本金安全，不在乎收益率比较低",
            "产生一定的收益，可以承担一定的投资风险",
            "产生较多的收益，可以承担较大的投资风险",
            "实现资产大幅增长，愿意承担很大的投资风险",
          ],
        },
        {
          ask: "您认为自己能承受的最大投资损失是多少",
          answers: [
            "尽可能保证本金安全",
            "一定的投资损失",
            "较大的投资损失",
            "损失可能超过本金",
          ],
        },
        {
          ask: "您打算将自己的投资回报主要用于",
          answers: [
            "改善生活",
            "个体生产经营或证券投资以外的投资行为",
            "履行扶养、抚养或赡养义务",
            "本人养老或医疗",
            "偿付债务",
          ],
          conflicts: { E: [{ key: "riskOption", disabled: ["3:A"] }] },
        },
      ],
    },
    {
      group: "其他信息",
      questions: [
        {
          ask: "您的年龄是",
          answers: [
            "18-30岁",
            "31-40岁",
            "41-50岁",
            "51-60岁",
            "超过60岁或未满18岁",
          ],
          hidden: !0,
          prop: "age",
        },
        {
          ask: "今后五年时间内，您的父母、配偶以及未成年子女等需负法定抚养、扶养和赡养义务的人数为",
          answers: ["1-2人", "3-4人", "5人以上"],
        },
        {
          ask: "您的最高学历是",
          answers: ["高中或以下", "大学专科", "大学本科", "硕士及以上"],
          hidden: !0,
          prop: "edu",
        },
        {
          ask: "您家庭的就业状况是",
          answers: [
            "您与配偶均有稳定收入的工作",
            "您与配偶其中一人有稳定收入的工作",
            "您与配偶均没有稳定收入的工作或者已退休",
            "未婚，但有稳定收入的工作",
            "未婚，目前暂无稳定收入的工作",
          ],
          conflicts: {
            A: [{ key: "riskOption", disabled: ["1:E"] }],
            D: [{ key: "riskOption", disabled: ["1:E"] }],
            C: [{ key: "riskOption", disabled: ["1:A", "1:B", "1:C", "1:D"] }],
          },
        },
      ],
    },
  ],
  varieties: [
    "债券、货币市场基金、债券基金等固定收益类投资品种",
    "股票、混合型基金、偏股型基金、股票型基金等权益类投资品种",
    "期货、融资融券等",
    "复杂或高风险金融产品或服务",
    "其他产品或服务",
  ],
};
