require("../../../@babel/runtime/helpers/Arrayincludes"),
  require("../../../app.js");
var s = require("../../../common/components/Dialog/index.js"),
  e = {
    version: "5",
    statements: [
      "本问卷旨在了解您可承受的风险程度等情况，借此协助您选择合适的金融产品或金融服务类别，以符合您的风险承受能力。",
      "风险承受能力评估是本公司向客户履行适当性职责的一个环节，其目的是使本公司所提供的金融产品或金融服务与您的风险承受能力等级相匹配。",
      "本公司特别提醒您：本公司向客户履行风险承受能力评估等适当性职责，并不能取代您自己的投资判断，也不会降低金融产品或金融服务的固有风险。同时，与金融产品或金融服务相关的投资风险、履约责任以及费用等将由您自行承担。",
      "本公司提示您：本公司根据您提供的信息对您进行风险承受能力评估，开展适当性工作。您应当如实提供相关信息及证明材料，并对所提供的信息和证明材料的真实性、准确性、完整性负责，否则您将依法承担相应责任。",
      "本公司建议：当您的各项状况发生重大变化时，您应当及时告知本公司，本公司将根据您更新后的信息或者您的后续风险承受能力评估申请，重新评估您的风险承受能力等级，以确保您的投资决定与您可承受的投资风险程度等相匹配。",
      "本公司在此承诺，对于您在本问卷中所提供的一切信息，本公司将严格按照法律法规要求承担保密义务。除法律法规规定的有权机关依法定程序进行查询以外，本公司保证不会将涉及您的任何信息提供、泄露给广发证券以外的第三方，或者将相关信息用于违法、不当用途。",
    ],
    prompts: [
      {
        group: "财务状况",
        questions: [
          {
            ask: "您在过去5年内是否有不良诚信记录(包括银行贷款违约、信用卡逾期、融资融券业务违约等)?",
            answers: ["没有不良诚信记录", "有不良诚信记录"],
            hideSymbol: !0,
          },
          {
            ask: "您的家庭稳定的可支配年收入（折合人民币）",
            answers: [
              "不高于10万元",
              "10万—50万(含)",
              "50万—100万(含)",
              "100万-500万(含)",
              "500万以上",
            ],
          },
          {
            ask: "您的收入主要来源是",
            answers: [
              "工资、劳务报酬（不含退休工资）",
              "生产经营所得",
              "利息、股息、转让证券等金融性资产收入",
              "出租、出售房地产等非金融性资产收入",
              "已退休或无固定收入",
            ],
            conflicts: {
              A: [
                { key: "riskOption", disabled: ["20:C", "20:E"] },
                { key: "job", disabled: ["234"] },
              ],
              E: [{ key: "riskOption", disabled: ["20:A", "20:D"] }],
            },
          },
          {
            ask: "您家庭预计进行证券投资的资金占家庭现有总资产(不含自住、自用房产及汽车等固定资产)的比例是",
            answers: ["70%以上", "50%-70%", "30%-50%", "10%-30%", "10%以下"],
          },
          {
            ask: "您的债务（包括但不限于银行贷款、信用卡欠款、民间借贷、白条、花呗及其他金融负债等）情况",
            answers: [
              "没有债务",
              "债务占总资产10%以下",
              "债务占总资产10%-50%",
              "债务占总资产50%-100%",
              "债务占总资产超过100%",
            ],
          },
          {
            ask: "您可用于投资的资产数额（包括银行存款、房产等金融资产和不动产）为",
            answers: [
              "不超过50万元人民币",
              "50万-300万元（不包含）人民币",
              "300万-1000万元（不包含）人民币",
              "1000万元人民币（以上）",
            ],
          },
        ],
      },
      {
        group: "投资经验及知识",
        questions: [
          {
            ask: "您的投资知识及对金融市场的了解情况可描述为",
            answers: [
              "基本没有：对金融市场知识基本不了解",
              "一般：基本了解金融市场及其相关风险，具有一定的金融市场知识，希望得到进一步的指导",
              "丰富：对金融市场及其相关风险具有较为丰富的知识和理解，可自己做出投资决策",
              "专业：取得经济金融、投资、会计相关的专业证书、证券从业资格、期货从业资格、有金融经济或财会等与金融产品投资相关专业学习或者学历背景，或现在或此前曾从事金融、经济或财会等与金融产品投资相关的工作",
            ],
            conflicts: {
              selectFn: function (e) {
                var n =
                  arguments.length > 1 && void 0 !== arguments[1]
                    ? arguments[1]
                    : {};
                return new Promise(function (i) {
                  e.includes(3) && ["4", "6", "10"].includes(n.edu)
                    ? s.Dialog({
                        title: "温馨提示",
                        message:
                          '<p style="text-align:left;">您确认您取得经济金融、投资、会计相关的专业证书、证券从业资格、期货从业资格、有金融经济或财会等与金融产品投资相关专业学习或者学历背景，或现在或此前曾从事金融、经济或财会等与金融产品投资相关的工作。</p>',
                        messageType: "html",
                        confirmButtonText: "确认并下一题",
                        cancelButtonText: "重新选择",
                        showCancelButton: !0,
                        onConfirm: function () {
                          i({
                            goNext: !0,
                            stat: "trade.apply.riskanswer.answerconfirm",
                          });
                        },
                        onCancel: function () {
                          i({
                            goNext: !1,
                            stat: "trade.apply.riskanswer.answercancel",
                          });
                        },
                      })
                    : i({ goNext: !0 });
                });
              },
            },
          },
          {
            ask: "您的金融市场投资经验可以被概括为",
            answers: [
              "除银行活期账户和定期存款外，我基本没有其他投资经验",
              "我购买过债券、货币市场基金、债券型基金或其它固定收益类产品等",
              "我购买过股票、混合型基金、偏股型基金、股票型基金等权益类投资品种等",
              "我是一位非常有经验的投资者，参与过融资融券、期货、期权、复杂金融产品等",
            ],
          },
          {
            ask: "有一位投资者一个月内做了15笔交易（同一品种买卖各一次算一笔），您认为这样的交易频率",
            answers: ["太高了", "偏高", "正常", "偏低"],
          },
          {
            ask: "过去一年时间内，您购买的不同金融产品和接受的不同服务（含同一类型的不同金融产品或服务）的数量是",
            answers: ["0至5个", "6至10个", "11至15个", "16个以上"],
            conflicts: {
              B: [{ key: "riskOption", disabled: ["8:A"] }],
              C: [{ key: "riskOption", disabled: ["8:A"] }],
              D: [{ key: "riskOption", disabled: ["8:A"] }],
            },
          },
          {
            ask: "您过往金融市场投资中，在交易较为活跃的月份，平均月交易额大概是",
            answers: [
              "0-10万元",
              "10万元-30万元",
              "30万元-100万元",
              "100万元以上",
            ],
          },
        ],
      },
      {
        group: "投资目标",
        questions: [
          {
            ask: "您用于证券期货及相关投资的资金预计投资期限为",
            answers: [
              "短期——1年以内（可开通或购买最短投资期限在1年期以内的业务或产品）",
              "中期——3年以内（可开通或购买最短投资期限3年期以内的业务或产品）",
              "中长期——在5年以内（可开通或购买最短投资期限5年期以内的业务或产品）",
              "期限不限——（可开通或购买最短投资期限为任意期限的业务或产品）",
            ],
          },
          {
            ask: "您打算重点投资于哪些种类的投资品种:①债券，固定收益凭证，固定收益类资产管理产品等固定收益类金融产品；市场资讯产品；②股票，权益类资产管理产品等权益类金融产品；投资资讯产品；混合类（投资品种含固收类、权益类、商品及金融衍生品类）金融产品；股票质押式回购，约定购回式证券交易，股权激励融资等融资类业务；③融资融券，转融通等信用交易类；商品及金融衍生品类资产管理产品等衍生品类金融产品；期货，期权等杠杆交易类业务；④结构化金融产品、场外衍生品等复杂或高风险类金融产品或业务；其他金融产品或业务。",
            answers: ["①②③④", "①②③", "①②", "①"],
            hideSymbol: !0,
          },
        ],
      },
      {
        group: "风险偏好",
        questions: [
          {
            ask: "假设有两种不同的投资：投资A预期获得5%的收益，有可能承担相对较小损失；投资B预期获得20%的收益，但有可能承担相对较大亏损。您将您的投资资产分配为",
            answers: [
              "全部投资于A",
              "大部分投资于A",
              "两种投资各一半",
              "大部分投资于B",
              "全部投资于B",
            ],
          },
          {
            ask: "您投资的收益风险偏好是：（仅用作风险承受能力测评，不作为最终投资收益或损失的承诺）",
            answers: [
              "资产保值，尽可能保证本金安全或者不能承受任何亏损",
              " 产生一定的收益，可以承担一定的投资风险或损失",
              "产生较多的收益，可以承担较大的投资风险或损失",
              "实现资产大幅增长，愿意承担很大的投资风险,可以接受超过本金的损失",
            ],
            conflicts: {
              A: [{ key: "riskOption", disabled: ["14:E"] }],
              D: [{ key: "riskOption", disabled: ["14:A"] }],
            },
          },
        ],
      },
      {
        group: "其他信息",
        questions: [
          {
            ask: "您是属于下面哪个年龄段？",
            answers: [
              "18-30岁",
              "31-50岁",
              "51-60岁",
              "61-79岁",
              "不满18或80岁以上",
            ],
            hidden: !0,
          },
          {
            ask: "您的学历是",
            answers: [
              "博士",
              "硕士",
              "学士",
              "大专",
              "中专",
              "高中",
              "初中及其以下",
              "其他",
            ],
            hidden: !0,
          },
          {
            ask: "您打算将自己的投资回报主要用于",
            answers: [
              "改善生活",
              "个体生产经营或证券投资以外的投资行为",
              "履行扶养、抚养或赡养义务",
              "本人养老或医疗",
              "偿还债务",
            ],
            conflicts: { E: [{ key: "riskOption", disabled: ["5:A"] }] },
          },
          {
            ask: "今后五年时间内，您的父母、配偶以及未成年子女等需要负法定扶养、抚养和赡养义务的人数为",
            answers: ["0-2人", "3-4人", "5人以上"],
          },
          {
            ask: "您家庭的工作状况是",
            answers: [
              "您与配偶均有稳定收入的工作",
              "您与配偶其中一个人有稳定收入工作",
              "您与配偶均已退休或者没有稳定收入的工作",
              "未婚，但有稳定收入的工作",
              "未婚，目前暂无稳定收入的工作",
            ],
            conflicts: {
              A: [
                { key: "riskOption", disabled: ["3:E"] },
                {
                  key: "customFn",
                  customFn: function (s) {
                    var e = +((null == s ? void 0 : s.age) || 0),
                      n = null == s ? void 0 : s.sex;
                    return ("1" === n && e <= 22) || ("1" !== n && e <= 20);
                  },
                },
                { key: "job", disabled: ["234"] },
              ],
              B: [
                {
                  key: "customFn",
                  customFn: function (s) {
                    var e = +((null == s ? void 0 : s.age) || 0),
                      n = null == s ? void 0 : s.sex;
                    return ("1" === n && e <= 22) || ("1" !== n && e <= 20);
                  },
                },
              ],
              C: [
                { key: "riskOption", disabled: ["3:A"] },
                {
                  key: "customFn",
                  customFn: function (s) {
                    var e = +((null == s ? void 0 : s.age) || 0),
                      n = null == s ? void 0 : s.sex;
                    return ("1" === n && e <= 22) || ("1" !== n && e <= 20);
                  },
                },
              ],
              D: [
                { key: "riskOption", disabled: ["3:E"] },
                { key: "job", disabled: ["234"] },
              ],
              E: [{ key: "riskOption", disabled: ["3:A"] }],
            },
          },
        ],
      },
    ],
    varieties: [
      "债券，固定收益凭证，固定收益类资产管理产品等固定收益类金融产品；市场资讯产品；股票，权益类资产管理产品等权益类金融产品；投资资讯产品；混合类（投资品种含固收类、权益类、商品及金融衍生品类）金融产品；股票质押式回购，约定购回式证券交易，股权激励融资等融资类业务；融资融券，转融通等信用交易类；商品及金融衍生品类资产管理产品等衍生品类金融产品；期货，期权等杠杆交易类业务；结构化金融产品、场外衍生品等复杂或高风险类金融产品或业务；其他金融产品或业务。",
      "债券，固定收益凭证，固定收益类资产管理产品等固定收益类金融产品；市场资讯产品；股票，权益类资产管理产品等权益类金融产品；投资资讯产品；混合类（投资品种含固收类、权益类、商品及金融衍生品类）金融产品；股票质押式回购，约定购回式证券交易，股权激励融资等融资类业务；融资融券，转融通等信用交易类；商品及金融衍生品类资产管理产品等衍生品类金融产品；期货，期权等杠杆交易类业务；",
      "债券，固定收益凭证，固定收益类资产管理产品等固定收益类金融产品；市场资讯产品；股票，权益类资产管理产品等权益类金融产品；投资资讯产品；混合类（投资品种含固收类、权益类、商品及金融衍生品类）金融产品；股票质押式回购，约定购回式证券交易，股权激励融资等融资类业务；",
      "债券，固定收益凭证，固定收益类资产管理产品等固定收益类金融产品；市场资讯产品；",
    ],
    resultConfirm:
      "本人在贵公司的提示下，已经审慎考虑自身的风险承受能力在此确认：<br>本人经贵公司提示，已充分知晓贵公司向本人销售的金融产品或提供的金融服务将以本人此次确认的风险承受能力等级和投资品种、期限为基础，并对上述评估结果进行确认。<br>本人已经了解并愿意遵守国家有关证券市场管理的法律、法规、规章及相关业务规则，本人在此郑重承诺以上填写的内容真实、准确、完整，并了解了自己的风险承受能力等级与适合购买的金融产品或适合接受的金融服务类型。<br>若本人提供的信息发生任何重大变化，本人都会及时书面通知贵公司，若因未及时告知贵公司导致购买与本人实际风险承受能力不匹配的产品或服务及其他不利后果的，由本人承担相应的法律责任。<br>本人清楚明白，贵司履行投资者适当性职责不能取代本人的投资判断，不会降低金融产品或金融服务的固有风险，也不会影响本人依法承担相应的投资风险、履约责任以及费用。<br>本人承诺，本人为本人所有账户的实际控制人，不存在出借账户等情况，如因出借账户等行为所产生不利后果的，由本人承担相应的法律责任。<br>本人已知悉风险承受能力评估结果可能与现有持仓产品或现已开通权限风险等级不匹配情况，并已充分了解相关风险。",
    resultPeriodPreText: "拟投资期限",
    resultVarietiesPreText: "拟投资品种",
  };
exports.riskTest = e;
