require("../../../@babel/runtime/helpers/Arrayincludes"),
  require("../../../app.js");
var s =
    "根据您登记的职业信息，与您职业信息不符的选项暂不可选。如您的职业已发生变化，请您更新职业信息后再填写问卷。",
  e = {
    key: "customFn",
    customFn: function (s) {
      return !!s.age && Number(s.age) < 16;
    },
    tips: "根据您的年龄情况，与您年龄情况不符的选项暂不可选。",
  },
  i = {
    version: "1",
    statements: [
      "本问卷旨在了解您可承受的风险程度等情况，借此协助您选择合适的金融产品或金融服务类别，以符合您的风险承受能力。",
      "风险承受能力评估是招商证券向客户履行适当性职责的一个环节，其目的是使招商证券所提供的金融产品或金融服务与您的风险承受能力等级相匹配。",
      "招商证券特别提醒您：招商证券向客户履行风险承受能力评估等适当性职责，并不能取代您自己的投资判断，也不会降低金融产品或金融服务的固有风险；我公司向您提供的适当性匹配意见不表明对产品或者服务的风险和收益做出实质性判断或者保证。同时，与金融产品或金融服务相关的投资风险、履约责任以及费用等将由您自行承担。",
      "招商证券提示您：招商证券根据您提供的信息对您进行风险承受能力评估，开展适当性工作。您应当如实提供相关信息及证明材料，并对所提供的信息和证明材料的真实性、准确性、完整性负责。",
      "招商证券建议：当您的各项状况发生重大变化时，需对您所投资的金融产品及时进行重新审视，以确保您的投资决定与您可承受的投资风险程度等实际情况一致。",
      "招商证券在此承诺，对于您在本问卷中所提供的一切信息，招商证券将严格按照法律法规要求承担保密义务。除法律法规规定的有权机关依法定程序进行查询以外，招商证券保证不会将涉及您的任何信息提供、泄露给任何第三方，或者将相关信息用于违法、不当用途。",
    ],
    prompts: [
      {
        group: "财务状况",
        questions: [
          {
            ask: "您的主要收入来源是",
            answers: [
              "工资、劳务报酬",
              "生产经营所得",
              "利息、股息、转让证券等金融性资产收入",
              "出租、出售房地产等非金融性资产收入",
              "无固定收入",
            ],
            conflicts: {
              A: [{ key: "job", disabled: ["236"] }],
              B: [{ key: "job", disabled: ["200", "232", "236"], tips: s }],
              E: [
                {
                  key: "job",
                  unDisabled: ["234", "235", "236", "237"],
                  tips: s,
                },
              ],
            },
          },
          {
            ask: "您是否有尚未清偿的数额较大的债务，如有，其性质是",
            answers: [
              "没有",
              "有，住房抵押贷款等长期定额债务",
              "有，信用卡欠款、消费信贷等短期信用债务",
              "有，亲朋之间借款",
            ],
          },
          {
            ask: "您可用于投资的家庭总资产为",
            answers: [
              "不超过50万元人民币",
              "50万-300万元（不含）人民币",
              "300万-1000万元（不含）人民币",
              "1000万元人民币以上",
            ],
          },
          {
            ask: "目前您进行证券投资的资金占家庭总资产的百分之几",
            answers: ["70%以上", "50%-70%", "30%－50%", "10%－30%", "10%以下"],
          },
        ],
      },
      {
        group: "投资知识",
        questions: [
          {
            ask: "以下描述中何种符合您的实际情况",
            answers: [
              "现在或此前曾从事金融、经济或财会等与金融市场投资相关的工作超过两年",
              "已取得金融、经济或财会等与金融市场投资相关专业学士以上学位",
              "取得证券从业资格、期货从业资格、注册会计师证书（CPA）或注册金融分析师证书（CFA）中的一项及以上",
              "对金融市场及其相关风险具有基本的知识",
              "没有任何证券期货投资知识",
            ],
            conflicts: {
              B: [
                {
                  key: "customFn",
                  customFn: function (s) {
                    return ["3", "4", "5", "6"].includes(s.edu || "");
                  },
                },
              ],
            },
          },
        ],
      },
      {
        group: "投资经验",
        questions: [
          {
            ask: "您的投资经验可以被概括为",
            answers: [
              "无：我没有投资经验",
              "有限：除银行活期账户和定期存款外，我基本没有其他投资经验",
              "一般：除银行活期账户和定期存款外，我购买过基金、保险等理财产品，但还需要进一步的指导",
              "丰富：我是一位有经验的投资者，参与过股票、基金等产品的交易，并倾向于自己做出投资决策",
              "非常丰富：我是一位非常有经验的投资者，参与过权证、期货或创业板等高风险产品的交易",
            ],
            conflicts: {
              D: [{ key: "riskOption", disabled: ["5:E"] }],
              E: [{ key: "riskOption", disabled: ["5:E"] }],
            },
          },
          {
            ask: "有一位投资者一个月内做了15笔交易（同一品种买卖各一次算一笔），您认为这样的交易频率",
            answers: ["太高了", "偏高", "正常", "偏低"],
          },
          {
            ask: "过去一年时间内，您参与的不同金融产品或服务的数量是",
            answers: ["5个以下", "6至10个", "11至15个", "16个以上"],
            conflicts: {
              B: [{ key: "riskOption", disabled: ["6:A"] }],
              C: [{ key: "riskOption", disabled: ["6:A"] }],
              D: [{ key: "riskOption", disabled: ["6:A"] }],
            },
          },
          {
            ask: "以下金融产品或服务的复杂性依次递增，您投资经验达两年以上的最复杂金融产品或服务为",
            answers: [
              "银行存款",
              "固定收益类投资品种：如债券、货币基金、银行理财产品等",
              "权益类投资品种：如股票、混合型基金、股票型基金等",
              "衍生品类投资品种：如期货、期权、融资融券等",
              "复杂的投资品种：如信贷挂钩票据、股票挂钩票据、合成金融工具、资产支持证券、住房抵押贷款支持证券、债务抵押证券等",
            ],
            conflicts: {
              A: [{ key: "riskOption", disabled: ["6:D", "6:E"] }],
              B: [{ key: "riskOption", disabled: ["6:A"] }],
              C: [{ key: "riskOption", disabled: ["6:A", "6:B"] }],
              D: [{ key: "riskOption", disabled: ["6:A", "6:B", "6:C"] }],
              E: [{ key: "riskOption", disabled: ["6:A", "6:B", "6:C"] }],
            },
          },
          {
            ask: "如果您曾经从事过金融市场投资，在交易较为活跃的月份，交易额大概是多少",
            answers: [
              "10万元以内",
              "10万元-30万元",
              "30万元-100万元",
              "100万元以上",
              "从未投资过金融产品或服务",
            ],
            conflicts: {
              A: [{ key: "riskOption", disabled: ["6:A"] }],
              B: [{ key: "riskOption", disabled: ["6:A"] }],
              C: [{ key: "riskOption", disabled: ["6:A"] }],
              D: [{ key: "riskOption", disabled: ["6:A"] }],
              E: [
                {
                  key: "riskOption",
                  disabled: [
                    "6:B",
                    "6:C",
                    "6:D",
                    "6:E",
                    "8:B",
                    "8:C",
                    "8:D",
                    "9:B",
                    "9:C",
                    "9:D",
                    "9:E",
                  ],
                },
              ],
            },
          },
        ],
      },
      {
        group: "投资目标",
        questions: [
          {
            ask: "您计划的投资期限是多久",
            answers: ["短期——0到1年", "中期——1到5年", "长期——5年以上"],
          },
          {
            ask: "您对哪一类投资品种的投资兴趣较低？（所选品种将被视为不符合您的投资需求）",
            answers: [
              "固定收益类投资品种：如债券、货币基金、银行理财产品等",
              "权益类投资品种：如股票、混合型基金、股票型基金等",
              "衍生品类投资品种：如期货、期权、融资融券等",
              "复杂的投资品种：如信贷挂钩票据、股票挂钩票据、合成金融工具、资产支持证券、住房抵押贷款支持证券、债务抵押证券等",
              "没有不感兴趣的投资品种，以上全都感兴趣",
            ],
            hideSymbol: !0,
            showTips: {
              A: "选择该选项，将无法开通“公司债等债券”业务权限，且无法参与货币基金、天添利、加鑫宝等固定收益类投资品种",
              B: "选择该选项，投资品种与权益类投资不匹配，将影响参与混合型基金、股票型基金等权益类品种的投资",
              C: "选择该选项，将无法开通期货、期权、融资融券、股票质押等衍生品类投资品种的业务权限",
              D: "选择该选项，将无法参与信贷挂钩票据、股票挂钩票据等复杂的投资品种",
            },
          },
          {
            ask: "假设有两种不同的投资：投资A预期获得5%的收益，有可能承担非常小的损失；投资B预期获得20%的收益，但有可能面临25%甚至更高的亏损。您将您的投资资产分配为",
            answers: [
              "全部投资于A",
              "大部分投资于A",
              "两种投资各一半",
              "大部分投资于B",
              "全部投资于B",
            ],
          },
        ],
      },
      {
        group: "风险偏好",
        questions: [
          {
            ask: "当您进行投资时，您的首要目标是",
            answers: [
              "保证本金安全，不在乎收益率比较低",
              "产生一定的收益，可以承担一定的投资风险",
              "产生较多的收益，可以承担较大的投资风险",
              "实现资产大幅增长，愿意承担很大的投资风险",
            ],
            conflicts: {
              A: [
                { key: "riskOption", disabled: ["13:E"] },
                {
                  key: "riskOption",
                  disabled: ["13:D"],
                  tips: "根据您第13题选择的答案，本题相关冲突选项暂不可选。请您根据您的真实情况，如实填写问卷。如需调整，请返回修改。",
                },
              ],
              D: [{ key: "riskOption", disabled: ["13:A"] }],
            },
          },
          {
            ask: "您认为自己能承受的最大投资损失是多少",
            answers: ["5%以内", "5%-10%", "10%-30%", "30%-50%", "超过50%"],
            conflicts: {
              A: [{ key: "riskOption", disabled: ["13:E", "14:D"] }],
              B: [{ key: "riskOption", disabled: ["13:E", "14:D"] }],
              D: [{ key: "riskOption", disabled: ["13:A", "14:A"] }],
              E: [{ key: "riskOption", disabled: ["13:A", "14:A"] }],
            },
          },
          {
            ask: "您打算将自己的投资回报主要用于",
            answers: [
              "改善生活",
              "个体生产经营或证券投资以外的投资行为",
              "履行抚养、赡养或扶养等义务",
              "本人养老或医疗",
              "偿付债务",
            ],
            conflicts: { E: [{ key: "riskOption", disabled: ["2:A"] }] },
          },
        ],
      },
      {
        group: "其他信息",
        questions: [
          {
            ask: "您的年龄是",
            answers: [
              "16岁以下",
              "16-30岁",
              "31-40岁",
              "41-50岁",
              "51-60岁",
              "超过60岁",
            ],
            hidden: !0,
            prop: "age",
          },
          {
            ask: "今后五年时间内，您的父母、配偶以及未成年子女等需负抚养、赡养和扶养义务的人数为",
            answers: ["1-2人", "3-4人", "5人以上"],
          },
          {
            ask: "您的最高学历是",
            answers: [
              "初中及以下",
              "中专",
              "高中",
              "大专",
              "本科",
              "硕士",
              "博士",
            ],
            hidden: !0,
            prop: "edu",
          },
          {
            ask: "您家庭的就业状况是",
            answers: [
              "您与配偶均有稳定收入的工作",
              "您与配偶其中一人有稳定收入的工作",
              "您与配偶均没有稳定收入的工作或者已退休",
              "单身，但有稳定收入的工作",
              "单身，目前暂无稳定收入的工作",
            ],
            conflicts: {
              A: [
                { key: "job", disabled: ["236"] },
                { key: "riskOption", disabled: ["1:E"] },
                e,
              ],
              B: [e],
              C: [e],
              D: [
                { key: "job", disabled: ["236"] },
                { key: "riskOption", disabled: ["1:E"] },
              ],
              E: [
                {
                  key: "job",
                  unDisabled: ["234", "235", "236", "237"],
                  tips: s,
                },
              ],
            },
          },
        ],
      },
    ],
    varieties: [
      "固定收益类投资品种：如债券、货币基金、银行理财产品等",
      "权益类投资品种：如股票、混合型基金、股票型基金等",
      "衍生品类投资品种：如期货、期权、融资融券等",
      "复杂的投资品种：如信贷挂钩票据、股票挂钩票据、合成金融工具、资产支持证券、住房抵押贷款支持证券、债务抵押证券等",
    ],
  };
exports.riskTest = i;
