require("../../../@babel/runtime/helpers/Arrayincludes"),
  require("../../../app.js");
var s = require("../../apply/profile/utils/index.js"),
  e = ["E", "F"],
  n = function (s) {
    var e = s.job_risk_ans;
    return !!e && "B" === e;
  },
  r = function (s) {
    var n = s.job_risk_ans;
    return !!n && !e.includes(n);
  },
  i = function (e) {
    var n = Number(e.age);
    if (!n && 0 !== n) return !1;
    if (n < 18) return !0;
    var r = e.sex || "",
      i = "F" === e.job_risk_ans;
    return (
      !!(r === s.sexUtil.SEX_TYPE.MALE && n >= 18 && n <= 22 && i) ||
      !!(r === s.sexUtil.SEX_TYPE.FEMALE && n >= 18 && n <= 20 && i)
    );
  },
  a = {
    version: "103",
    statements: [
      "本问卷旨在了解您可承受的风险程度等情况，借此协助您选择合适的金融产品或金融服务类别，以符合您的风险承受能力。",
      "风险承受能力评估是本公司向客户履行适当性职责的一个环节，其目的是使本公司所提供的金融产品或金融服务与您的风险承受能力等级相匹配。",
      "本公司特别提醒您：本公司向客户履行风险承受能力评估等适当性职责，并不能取代您自己的投资判断，也不会降低金融产品或金融服务的固有风险。同时，与金融产品或金融服务相关的投资风险、履约责任以及费用等将由您自行承担。",
      "本次风险承受能力测评结果有效期为两年，超过两年后测评结果失效，如您未及时重新进行风险承受能力测评，本公司将不能向您销售相应金融产品或提供相应金融服务。",
      "每天填写风险承受能力测评问卷的次数不能超过2次，且以最后一次测评结果为准，请您谨慎认真填写。",
      "请根据自身实际情况独立填写风险承受能力测评问卷。",
      "本公司提示您：本公司根据您提供的信息对您进行风险承受能力评估，开展适当性工作。您应当如实提供相关信息及证明材料，并对所提供的信息和证明材料的真实性、准确性、完整性负责。您提供的信息发生重要变化、可能影响风险承受能力评估结果的，应当及时告知本公司或通过相关渠道重新进行风险承受能力测评。",
      "本公司建议：当您的各项状况发生重大变化时，需对您所投资的金融产品及时进行重新审视，以确保您的投资决定与您可承受的投资风险程度等实际情况一致。",
      "本公司在此承诺，对于您在本问卷中所提供的一切信息，本公司将严格按照法律法规要求承担保密义务。除法律法规规定的有权机关依法定程序进行查询以外，本公司保证不会将涉及您的任何信息提供、泄露给任何第三方，或者将相关信息用于违法、不当用途。",
    ],
    prompts: [
      {
        group: "个人信息",
        questions: [
          {
            ask: "您的年龄是",
            answers: [
              "18-30岁",
              "31-40岁",
              "41-50岁",
              "51-70岁",
              "18岁以下或超过70岁",
            ],
            hidden: !0,
            prop: "age",
          },
          {
            ask: "今后五年时间内，您的父母、配偶以及未成年子女等需负法定抚养、扶养和赡养义务的人数为",
            answers: ["0-2人", "3-4人", "5人以上"],
          },
          {
            ask: "您的最高学历是",
            answers: ["硕士及以上", "本科", "大专", "高中或以下"],
            hidden: !0,
            prop: "edu",
          },
          {
            ask: "您的职业为",
            answers: [
              "私营企业主",
              "金融从业人员",
              "军人\\武警部队人员\\党政机关工作人员",
              "事业单位职工\\公司职员（不含金融从业人员）\\离退休人员\\个体工商户",
              "自由职业者\\待业\\农民",
              "学生",
            ],
            hidden: !0,
            prop: "job",
          },
          {
            ask: "您家庭的就业状况是",
            answers: [
              "您与配偶均有稳定收入的工作",
              "未婚，但有稳定收入的工作",
              "您与配偶其中一人有稳定收入的工作",
              "目前没有稳定收入的工作",
            ],
            conflicts: {
              A: [{ key: "customFn", customFn: i }],
              C: [{ key: "customFn", customFn: i }],
              D: [{ key: "customFn", customFn: r }],
            },
          },
        ],
      },
      {
        group: "财务状况",
        questions: [
          {
            ask: "您的主要收入来源是",
            answers: [
              "工资（含退休工资）、劳务报酬",
              "生产经营所得",
              "利息、股息、转让证券等金融性资产收入",
              "出租、出售房地产等非金融性资产收入",
              "无固定收入",
            ],
            conflicts: {
              B: [
                {
                  key: "customFn",
                  customFn: function (s) {
                    var e = s.job_risk_ans;
                    return !!e && ("B" === e || "C" === e);
                  },
                },
              ],
              E: [
                { key: "customFn", customFn: r },
                { key: "riskOption", disabled: ["5:A", "5:B"] },
              ],
            },
          },
          {
            ask: "您的个人年收入是（包括个人年度可支配资金）",
            answers: [
              "100万元以上",
              "50万元-100万元",
              "10万元-50万元",
              "10万元以下",
            ],
            conflicts: {
              A: [
                {
                  key: "customFn",
                  customFn: function (s) {
                    var e = Number(s.age);
                    return !(!e && 0 !== e) && e < 20 && "F" === s.job_risk_ans;
                  },
                },
              ],
            },
          },
          {
            ask: "最近您家庭预计进行证券投资的资金占家庭现有总资产(不含自住、自用房产及汽车等固定资产)的比例是",
            answers: ["10%以下", "10%－30%", "30%－50%", "50%-70%", "70%以上"],
          },
          {
            ask: "您是否有尚未清偿的数额较大的债务，如有，其性质是",
            answers: [
              "没有",
              "有，住房抵押贷款等长期债务",
              "有，信用卡逾期欠款、大额消费信贷等短期债务",
              "有，民间大额借款",
            ],
          },
          {
            ask: "您可用于投资的资产数额（包括金融资产和不动产）为",
            answers: [
              "1000万元人民币以上",
              "300万-1000万元（不含）人民币",
              "50万-300万元（不含）人民币",
              "不超过50万元人民币",
            ],
          },
        ],
      },
      {
        group: "投资知识和专业能力",
        questions: [
          {
            ask: "以下描述中何种符合您的实际情况",
            answers: [
              "现在或此前曾从事金融、经济或财会等与金融产品投资相关的工作，或具备金融产品投资相关的学历背景，或取得与金融产品投资相关的从业证书、专业证书等",
              "我没有金融产品投资的相关工作或学历背景，但比较熟悉金融产品投资知识",
              "我没有金融产品投资的相关工作或学历背景，但了解部分金融产品投资知识",
              "我不符合以上任何一项描述",
            ],
            conflicts: {
              B: [{ key: "customFn", customFn: n }],
              C: [{ key: "customFn", customFn: n }],
              D: [{ key: "customFn", customFn: n }],
            },
          },
        ],
      },
      {
        group: "投资经验",
        questions: [
          {
            ask: "您的投资经验可以被概括为",
            answers: [
              "非常丰富：我是一位非常有经验的投资者，参与过权证、期货、衍生品等高风险产品的交易",
              "丰富：我是一位有经验的投资者，参与过股票、基金等产品的交易，并倾向于自己做出投资决策",
              "一般：除银行活期账户和定期存款外，我购买过基金、保险等理财产品，但还需要进一步的指导",
              "有限：除银行活期账户和定期存款外，我基本没有其他投资经验",
            ],
          },
          {
            ask: "有一位投资者一个月内做了15笔交易（同一品种买卖各一次算一笔），您认为这样的交易频率",
            answers: ["偏低", "正常", "偏高", "太高了"],
          },
          {
            ask: "过去一年时间内，您购买的不同金融产品（含同一类型的不同金融产品）的数量是",
            answers: ["16个以上", "11至15个", "6至10个", "5个以下"],
            conflicts: {
              A: [{ key: "riskOption", disabled: ["12:D"] }],
              B: [{ key: "riskOption", disabled: ["12:D"] }],
            },
          },
          {
            ask: "以下金融产品或服务，您投资经验在两年以上的有",
            answers: [
              "衍生品、私募股权投资基金等复杂金融产品、其他产品或服务",
              "期货、股票期权、融资融券等",
              "股票、混合型基金、偏股型基金、股票型基金等权益类投资品种",
              "债券、货币市场基金、债券型基金或其它固定收益类产品",
              "银行存款等",
            ],
            multiple: !0,
            conflicts: {
              A: [{ key: "riskOption", disabled: ["12:C", "12:D"] }],
              B: [{ key: "riskOption", disabled: ["12:C", "12:D"] }],
              C: [{ key: "riskOption", disabled: ["12:D"] }],
              D: [{ key: "riskOption", disabled: ["12:D"] }],
            },
          },
          {
            ask: "如果您曾经从事过金融产品投资，在交易较为活跃的月份，平均月交易额大概是多少",
            answers: [
              "100万元以上",
              "30万元-100万元",
              "10万元-30万元",
              "10万元以内",
            ],
          },
        ],
      },
      {
        group: "投资目标",
        questions: [
          {
            ask: "您可接受的最长投资期限是",
            answers: [
              "短期——1年及以下（不适合购买期限超过1年的产品）",
              "中短期——1到3年（含）（不适合购买期限超过3年的产品）",
              "中长期——3到5年（含）（不适合购买期限超过5年的产品）",
              "长期——超过5年（适合购买任意期限的产品）",
            ],
          },
          {
            ask: "您打算重点投资哪些种类的投资品种？\n ①固定收益类投资品种如债券、货币市场基金、债券基金、保本类收益凭证等\n ②权益类投资品种如股票、混合型基金、偏股型基金、股票型基金等\n ③另类投资品种如股票质押式回购、股权激励行权融资、约定购回式证券交易、转融通证券出借交易、信托、基金专项计划等\n ④杠杆类投资品种如融资融券、期货、期权等\n ⑤复杂或高风险金融产品如私募股权投资基金、创业投资基金、结构化产品、资产支持证券、衍生品等",
            answers: ["①②③④⑤", "①②③④", "①②③", "①②", "①"],
          },
          {
            ask: "假设有两种不同的投资：投资A预期获得5%的收益，有可能承担非常小的损失；投资B预期获得20%的收益，但有可能面临25%甚至更高的亏损。您将您的投资资产分配为",
            answers: [
              "全部投资于A",
              "大部分投资于A",
              "两种投资各一半",
              "大部分投资于B",
              "全部投资于B",
            ],
          },
        ],
      },
      {
        group: "风险偏好",
        questions: [
          {
            ask: "当您进行投资时，您的首要目标及能承受的最大投资损失是",
            answers: [
              "产生较大的收益，可以承担较大的投资风险",
              "产生一定的收益，可以承担一定的投资风险",
              "产生较少的收益，可以承担较少的投资风险",
              "可以不产生收益，尽可能保证本金安全",
            ],
            conflicts: {
              A: [{ key: "riskOption", disabled: ["19:A"] }],
              C: [{ key: "riskOption", disabled: ["19:D", "19:E"] }],
              D: [
                {
                  key: "riskOption",
                  disabled: ["18:A", "18:B", "18:C", "18:D", "19:D", "19:E"],
                },
              ],
            },
          },
          {
            ask: "您打算将自己的投资回报主要用于",
            answers: [
              "改善生活",
              "个体生产经营或证券投资以外的投资行为",
              "履行扶养、抚养或赡养义务",
              "本人养老或医疗",
              "偿付债务",
            ],
            conflicts: { E: [{ key: "riskOption", disabled: ["9:A"] }] },
          },
        ],
      },
    ],
    varieties: [
      "固定收益类投资品种如债券、货币市场基金、债券基金、保本类收益凭证等；权益类投资品种如股票、混合型基金、偏股型基金、股票型基金等；另类投资品种如股票质押式回购、股权激励行权融资、约定购回式证券交易、转融通证券出借交易、信托、基金专项计划等；杠杆类投资品种如融资融券、期货、期权等；复杂或高风险金融产品如私募股权投资基金、创业投资基金、结构化产品、资产支持证券、衍生品等",
      "固定收益类投资品种如债券、货币市场基金、债券基金、保本类收益凭证等；权益类投资品种如股票、混合型基金、偏股型基金、股票型基金等；另类投资品种如股票质押式回购、股权激励行权融资、约定购回式证券交易、转融通证券出借交易、信托、基金专项计划等；杠杆类投资品种如融资融券、期货、期权等",
      "固定收益类投资品种如债券、货币市场基金、债券基金、保本类收益凭证等；权益类投资品种如股票、混合型基金、偏股型基金、股票型基金等；另类投资品种如股票质押式回购、股权激励行权融资、约定购回式证券交易、转融通证券出借交易、信托、基金专项计划等",
      "固定收益类投资品种如债券、货币市场基金、债券基金、保本类收益凭证等；权益类投资品种如股票、混合型基金、偏股型基金、股票型基金等",
      "固定收益类投资品种如债券、货币市场基金、债券基金、保本类收益凭证等",
    ],
    resultPeriodPreText: "投资期限偏好为",
    resultVarietiesPreText: "投资品种偏好为",
  };
exports.riskTest = a;
