require("../../../app.js"),
  (exports.PRESIGN_MATCH_CONFIG = {
    variety: {
      prop: "investVariety",
      disqualifyIfOnly: [
        "债券、货币市场基金、债券基金等固定收益类投资品种，即期结售汇业务",
      ],
    },
    income: {
      prop: "expectIncome",
      disqualifyOptions: [
        "没有风险容忍度，不能接受任何损失",
        "期望收益比较低，尽可能保证本金安全",
      ],
    },
  }),
  (exports.riskTest = {
    version: "30",
    statements: [
      "本问卷旨在了解您可承受的风险程度等情况，借此协助您选择合适的产品或服务类别，以符合您的风险承受能力。",
      "风险承受能力评估是本公司向投资者履行适当性职责的一个环节，其目的是使本公司所提供的产品或服务与您的风险承受能力等级相匹配。",
      "本公司特别提醒您：本公司向投资者履行风险承受能力评估等适当性职责，并不能取代您自己的投资判断，也不会降低产品或服务的固有风险。同时，与产品或服务相关的投资风险、履约责任以及费用等将由您自行承担。",
      "本公司提示您：本公司根据您提供的信息对您进行风险承受能力评估，开展适当性工作。您应当如实提供相关信息及证明材料，并对所提供的信息和证明材料的真实性、准确性、完整性负责。",
      "本公司建议：当您的各项状况发生重大变化时，需对您所投资的产品及时进行重新审视，以确保您的投资决定与您可承受的投资风险程度等实际情况一致。",
      "本公司在此承诺，对于您在本问卷中所提供的一切信息，本公司将严格按照法律法规要求承担保密义务。除法律法规规定的有权机关依法定程序进行查询以外，本公司保证不会将涉及您的任何信息提供、泄露给任何第三方，或者将相关信息用于违法、不当用途。",
    ],
    prompts: [
      {
        group: "财务状况",
        questions: [
          {
            ask: "您的主要收入来源是",
            answers: [
              "工资、劳务报酬",
              "生产经营所得",
              "利息、股息、转让证券等金融性资产收入",
              "出租、出售房地产等非金融性资产收入",
              "无固定收入来源",
            ],
          },
          {
            ask: "最近您家庭预计进行证券投资的资金占家庭现有总资产(不含自住、自用房产及汽车等固定资产)的比例是",
            answers: ["70%以上", "50%-70%", "30%－50%", "10%－30%", "10%以下"],
          },
          {
            ask: "您是否有尚未清偿的数额较大的债务，如有，其性质是",
            answers: [
              "没有",
              "有，信用卡欠款、消费信贷等短期信用债务",
              "有，1-3人需履行抚养、扶养和赡养义务",
              "有，住房抵押贷款等长期大额债务",
              "有，3人以上需履行抚养、扶养和赡养义务",
            ],
          },
          {
            ask: "您的家庭可支配收入为（折合人民币）",
            answers: [
              "50万元以下",
              "50-100万元",
              "100-500万元",
              "500-1000万元",
              "1000万元以上",
            ],
          },
          {
            ask: "您可用于投资的资产数额（包括金融资产和不动产）为",
            answers: [
              "不超过50万元人民币",
              "50万-300万元（不含）人民币",
              "300万-1000万元（不含）人民币",
              "1000万元人民币以上",
            ],
          },
        ],
      },
      {
        group: "投资知识",
        questions: [
          {
            ask: "以下描述中何种符合您的实际情况",
            answers: [
              "现在或此前曾从事金融、经济或财会等与金融产品投资相关的工作超过两年",
              "已取得金融、经济或财会等与金融产品投资相关专业学士以上学位",
              "取得证券从业资格、基金从业资格、期货从业资格、注册会计师证书（CPA）或注册金融分析师证书（CFA）中的一项及以上",
              "通过自学、参加课程、接受培训等方式掌握了一定的证券期货投资知识",
              "我不符合以上任何一项描述",
            ],
          },
        ],
      },
      {
        group: "投资经验",
        questions: [
          {
            ask: "您的投资经验可以被概括为",
            answers: [
              "有限：除银行活期账户和定期存款外，我基本没有其他投资经验",
              "一般：除银行活期账户和定期存款外，我购买过债券、货币市场基金、债券基金等固定收益产品，但还需要进一步的指导",
              "丰富：我是一位有经验的投资者，具有股票、混合型基金、偏股型基金、股票型基金等权益类产品2年以上的交易经验，并倾向于自己做出投资决策",
              "非常丰富：我是一位非常有经验的投资者，具有创业板、期货、期权、融资融券等高风险产品2年以上的交易经验",
              "我至少参与过股票、混合型基金、偏股型基金、股票型基金、创业板、期货、期权、融资融券等产品中一项的交易，但交易经验不足2年",
            ],
          },
          {
            ask: "有一位投资者一个月内做了15笔交易（同一品种买卖各一次算一笔），您认为这样的交易频率",
            answers: ["太高了", "偏高", "正常", "偏低"],
          },
          {
            ask: "在您金融市场投资交易较为活跃的月份，平均月交易额大概是多少",
            answers: [
              "0-10万元",
              "10万元-30万元",
              "30万元-100万元",
              "100万元以上",
            ],
          },
        ],
      },
      {
        group: "投资目标",
        questions: [
          {
            ask: "您用于证券投资的大部分资金不会用作其它用途的时间段为",
            answers: ["0到1年", "0到5年", "无特别要求"],
          },
          {
            ask: "您打算重点投资于哪些种类的投资品种（注：本题可多选，但评分以其中最高分值选项为准。）",
            answers: [
              "债券、货币市场基金、债券基金等固定收益类投资品种，即期结售汇业务",
              "股票、混合型基金、偏股型基金、股票型基金等权益类投资品种",
              "集中交易场所的期货、期权、融资融券等",
              "复杂金融产品或服务",
              "其他产品或服务",
            ],
            multiple: !0,
            prop: "investVariety",
          },
          {
            ask: "当您进行投资时，您的首要目标和您认为自己能承受的最大投资损失是",
            answers: [
              "没有风险容忍度，不能接受任何损失",
              "期望收益比较低，尽可能保证本金安全",
              "期望产生一定的收益，可以承担一定的投资风险",
              "期望产生较多的收益，可以承担较大的投资风险",
              "期望实现资产大幅增长，愿意承担很大的投资风险",
            ],
            prop: "expectIncome",
          },
        ],
      },
      {
        group: "风险偏好",
        questions: [
          {
            ask: "假设有两种不同的投资：投资A预期获得5%的收益，有可能承担非常小的损失；投资B预期获得20%的收益，但有可能面临25%甚至更高的亏损。您将您的投资资产分配为",
            answers: [
              "全部投资于A",
              "大部分投资于A",
              "两种投资各一半",
              "大部分投资于B",
              "全部投资于B",
            ],
          },
          {
            ask: "您打算将自己的投资回报主要用于",
            answers: [
              "改善生活",
              "个体生产经营或证券投资以外的投资行为",
              "养老或医疗",
              "偿付债务",
            ],
          },
        ],
      },
      {
        group: "其他信息",
        questions: [
          {
            ask: "您的年龄是",
            answers: [
              "18-30岁",
              "31-40岁",
              "41-50岁",
              "51-60岁",
              "低于18岁或高于60岁",
            ],
            hidden: !0,
            prop: "age",
          },
          {
            ask: "您的最高学历是",
            answers: ["高中或以下", "大学专科", "大学本科", "硕士及以上"],
            hidden: !0,
            prop: "edu",
          },
        ],
      },
    ],
    varieties: [
      "债券、货币市场基金、债券基金等固定收益类投资品种，即期结售汇业务",
      "股票、混合型基金、偏股型基金、股票型基金等权益类投资品种",
      "集中交易场所的期货、期权、融资融券等",
      "复杂金融产品或服务",
      "其他产品或服务",
    ],
  });
