require("../../app.js");
(exports.RiskCfg = {
  indexTip:
    "1.注册制股票上市前五个交易日无涨跌幅限制，请您注意股价波动风险及破发风险，充分评估自身风险承受能力，依法合规，理性参与。\n2.对于重复申购的，以时间上第一笔申购为有效申购，其余申购为无效申购。\n3.连续12个月内累计出现3次中签但未足额缴款的情形，将被交易所暂停新股（债）、存托凭证申购资格6个月。\n4.场内交易委托如不符合交易规则，可能会被交易所判为废单，请您充分了解并遵守交易规则。\n5.如您已开通“新股中签资金冻结”服务，请您充分了解资金冻结情况。\n6.以上仅作为要点提示，参与新股申购前请您充分了解交易所相关规则。",
  confirmTip:
    "注册制股票上市前五个交易日无涨跌幅限制，请您注意股价波动风险及破发风险，充分评估自身风险承受能力，依法合规，理性参与。对于重复申购的，以时间上第一笔申购为有效申购，其余申购为无效申购。连续12个月内累计出现3次中签但未足额缴款的情形，将被交易所暂停新股（债）、存托凭证申购资格6个月。场内交易委托如不符合交易规则，可能会被交易所判为废单，请您充分了解并遵守交易规则。",
  confirmTipHeader: "重要提示",
  luckyTip:
    "注册制股票上市前五个交易日无涨跌幅限制，请您注意股价波动风险及破发风险，充分评估自身风险承受能力，依法合规，理性参与。连续12个月内累计出现3次中签但未足额缴款的情形，将被交易所暂停新股（债）、存托凭证申购资格6个月。如您已开通“新股中签资金冻结”服务，请您充分了解资金冻结情况。",
  isHidePerformanceBar: !1,
  isHidePerformanceBlock: !1,
}),
  (exports.tabEnum = { PURCHASE: 0, BOOKING: 1, PERFORMANCE: 2 });
